11/data/attachments/b44c88932ee7a440.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c3b3d69a-4e2f-4150-a823-a60f5c39cb40</nif:username>
            <nif:friendToBeAdded>Joan_art_Friend_25733_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>